#include <iostream>
#include<cmath>                      // Під'єднання бібліотеки математичних функцій
using namespace std;

int main()
{
   long double a,b;                  // Перше та друге значення у виразі
   long double rez;                  // Різниця двох послідовних значень у виразі
   long double fact,d;               // Змінні для знаходження факторіала та значення двійки в вказаному степені відповідно
   long double c;                    // i-те значення у виразі
   long double x,                    // Число на проміжку [0,2]
   e,                                // Змінна для точності обчислення
   s;                                // Змінна для суми всіх послідовних значень
   int i;                            // Лічильник
    cout<<"Enter number 0<=x<=2: "; cin>> x;
    if((x<=2) && (x>=0))
    {
        a=(x*x-1)/(2);
        b=(2*x*x-1)/(1+2);
        rez=abs(a-b);
        s=a+b;
        i=3;
        fact=1;
        e=pow(10,-5);

   while(e<rez)                       // Доки точність менша ніж різниця двох послідовних чисел виконуємо тіло циклу
    {
            d=pow(2,i-1);                 // Піднесення двійки до степеня i-1
            for (int k=1; k<=d; k++)
            {
                fact=fact*k;              // Обчислення факторіалу числа d
            }

            c=(i*x*x-1)/(1+fact);         // Обчислення і-того значення у виразі
            rez=abs(c-b);                 // Різниця двох послідовних значень у виразі
            i++;
            s=s+c;                        // Збільшення суми на і-тий елемент виразу
            b=c;                          // Присвоєння значення змінної с змінній b

            fact=1;                       // Присвоєння факторіалу значення 1 для коректності його визначення для наступного елемента

        }
        cout <<"The sum of all elements to the nearest 10^(-5): " <<s<<endl<<endl;                        // Виведення суми всіх послідовних значень з точністю до 10^(-5)
    }
    else cout<<"Don't correct data";
}
